NextFOAM-2405/tutorials/compressible/rhoPimpleFoam/RAS/annularThermalMixer/0.orig/nut
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2312                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      nut;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

#include "<constant>/caseSettings"

dimensions      [0 2 -1 0 0 0 0];

internalField   uniform 0;

boundaryField
{
    inlet
    {
        $/calculated/nut;
    }

    outlet
    {
        $/calculated/nut;
    }

    movingWalls
    {
        $/wall/nut;
    }

    staticWalls
    {
        $movingWalls;
    }

    #includeEtc "caseDicts/setConstraintTypes"
}


// ************************************************************************* //
